In [7]:
#Pandas : 데이터 분석시 가장 많이 쓰이는 패키지, 표table 데이터를 다루기 위한
#시리즈 클래스 : numpy의 1차원 배열과 비슷하지만 인덱스index붙일 수 있다
#시리즈 = 값value + 인덱스index
#시리즈 생성
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index = ["서울", "부산","인천","대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [8]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [9]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [10]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [13]:
#시리즈 연산 : NumPy처럼 벡터화연산가능, 인덱스값은 변화없음
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [15]:
#시리즈 인덱싱 : 슬라이싱도 가능
s[1], s["인천"]

(3448737, 2890451)

In [16]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [19]:
s[["서울","대구","부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [20]:
s[(250e4 < s) & (s < 500e4)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [21]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [22]:
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [23]:
s0 = pd.Series(range(3), index = ["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [24]:
s0.a

0

In [28]:
#시리즈와 딕셔너리 자료형 : 라벨 값에 의해 인덱싱하므로 라벨 값을 키로가지는 딕셔너리 자료형과 같다고볼 수 있다
"서울" in s

True

In [29]:
"대전" in s

False

In [30]:
for k,v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [31]:
#dictionary에서 시리즈만들 수도 있음
s2 = pd.Series({"서울":9631482, "부산":3393191, "인천":2632035, "대전":4190158})
s2
#dictionary 원소는 순서가 없으므로 시리즈의 데이터도 순서 보장안됨

서울    9631482
부산    3393191
인천    2632035
대전    4190158
dtype: int64

In [32]:
#순서 정하고 싶으면 인덱스를 리스트로 지정해야함
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
               index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [38]:
#인덱스 기반 연산
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [36]:
s.values - s2.values

array([ 6511121, -6182745,   258416,   975894], dtype=int64)

In [37]:
#NaN이 아닌 값을 구하기
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [39]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [40]:
#인구 증가율(%) 구하기
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [42]:
#데이터의 갱신, 추가, 삭제
##인덱싱!!!
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [45]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [46]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [60]:
#연습 문제 1
s1 = pd.Series([90, 93, 80, 100],
              index = ["국어", "수학","영어","과학"])
s2 = pd.Series([39, 39, 40, 10],
              index = ["국어", "수학","음악","과학"])
ds = s1 / s2
ds.notnull()
ds = ds[ds.notnull()]
ds

과학    10.000000
국어     2.307692
수학     2.384615
dtype: float64

In [108]:
#데이터프레임 클래스
##시리즈 : 1차원 벡터 데이터, 데이트프레임 : 2차원 행렬 데이터
#데이터프레임 생성
#1.하나의 열이되는 데이터를 리스트 또는 일차원 배열로 준비
#2.각각의 열에 대한 이름(라벨)을 키로 가지는 딕셔너리 생성
#3.이 데이터를 DataFrame 클래스 생성자 삽입, colums & index 인수 지정
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df
##실은 공통인덱스를 가지는 열시리즈를 딕셔너리로 묵은 것과 같음

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [62]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [64]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [65]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [66]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [81]:
#연습 문제 2 임의의 데이터프레임 만들기
data = {
    "국어": [90,95,100,85],
    "수학": [70,100,80,95],
    "영어": [95,95,100,90],
    "과학": [100,95,90,100],
    "예술": [59,90,30,100],
    "성별":["남학생","여학생","남학생","여학생"],
    
}

columns = ["성별","국어","수학","영어","과학","예술"]
index = ["철수","은비","주연","우현"]
df = pd.DataFrame(data,index = index, columns = columns)
df.index.name = "이름"
df.columns.name = "성별 및 과목"
df

성별 및 과목   성별   국어   수학   영어   과학   예술
이름
철수       남학생   90   70   95  100   59
은비       여학생   95  100   95   95   90
주연       남학생  100   80  100   90   30
우현       여학생   85   95   90  100  100

In [82]:
#transpose가능
df.T

이름        철수   은비   주연   우현
성별 및 과목
성별       남학생  여학생  남학생  여학생
국어        90   95  100   85
수학        70  100   80   95
영어        95   95  100   90
과학       100   95   90  100
예술        59   90   30  100

In [83]:
#열 데이터의 갱신, 추가, 삭제
##데이터 프레임은 열 시리즈의 딕셔너리로 볼 수 있으므로 열 단위로 데이터 갱신, 추가, 삭제 가능
df["예술"] = df["예술"] + 100
df

성별 및 과목   성별   국어   수학   영어   과학   예술
이름
철수       남학생   90   70   95  100  159
은비       여학생   95  100   95   95  190
주연       남학생  100   80  100   90  130
우현       여학생   85   95   90  100  200

In [86]:
df["예술"] = ((df["국어"] - df["수학"]) / df["영어"] * 100).round(2)
df

성별 및 과목   성별   국어   수학   영어   과학     예술
이름
철수       남학생   90   70   95  100  21.05
은비       여학생   95  100   95   95  -5.26
주연       남학생  100   80  100   90  20.00
우현       여학생   85   95   90  100 -11.11

In [87]:
del df["국어"]
df

성별 및 과목   성별   수학   영어   과학     예술
이름
철수       남학생   70   95  100  21.05
은비       여학생  100   95   95  -5.26
주연       남학생   80  100   90  20.00
우현       여학생   95   90  100 -11.11

In [88]:
#열 인덱싱
##데이터프레임 인덱싱할 때도 열라벨을 키값으로 생각해 인덱싱 가능
df["성별"]

이름
철수    남학생
은비    여학생
주연    남학생
우현    여학생
Name: 성별, dtype: object

In [90]:
df[["영어","수학"]]

성별 및 과목   영어   수학
이름
철수        95   70
은비        95  100
주연       100   80
우현        90   95

In [97]:
df[["영어"]]

성별 및 과목   영어
이름
철수        95
은비        95
주연       100
우현        90

In [93]:
#데이터프레임 자료형 유지할 때
type(df[["영어"]])

pandas.core.frame.DataFrame

In [94]:
df["영어"]

이름
철수     95
은비     95
주연    100
우현     90
Name: 영어, dtype: int64

In [98]:
type(df["영어"])

pandas.core.series.Series

In [101]:
#열 인덱스가 문자열 라벨이면 정수 인덱스를 열 인덱싱에 사용불가
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [102]:
#단, 원래 정수형 열 인덱싱일 경우 사용 가능 ^^
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [106]:
df2[[1,3]]

   1   3
0  1   3
1  5   7
2  9  11

In [109]:
#행 인덱싱 : 항상 슬라이싱
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [110]:
df[:1]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [111]:
df[1:2]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [112]:
df[1:3]

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [113]:
df["서울" : "부산"]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163

In [114]:
#개별 데이터 인덱싱
##열라벨 시리즈 인덱싱 > 시리즈 >행라벨 인덱싱 > 개별 데이터
df["2015"]["서울"]

9904312

In [115]:
#연습 문제 3
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [119]:
#연습 문제 3-1 ; 모든 학생의 수학 점수를 시리즈로 나타낸다.
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [120]:
type(df["수학"])

pandas.core.series.Series

In [121]:
#연습 문제 3-2 : 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타내
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [123]:
type(df[["국어","영어"]])

pandas.core.frame.DataFrame

In [138]:
#연습 문제 3-3 : 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df["평균"] = ((df["국어"] + df["수학"] + df["영어"]) /3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [147]:
#연습 문제 3-4 : 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산
df["영어"]["방자"] = 80
df["평균"] = ((df["국어"] + df["수학"] + df["영어"]) /3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [149]:
#연습 문제 3-5 : 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [150]:
type(df[:1])

pandas.core.frame.DataFrame

In [154]:
#연습 문제 3-6 : 향단의 점수를 시리즈로 나타낸다. -> Transpose!!
df.T

       춘향     몽룡    향단    방자
국어  80.00  90.00  70.0  30.0
영어  90.00  70.00  60.0  80.0
수학  90.00  60.00  80.0  70.0
평균  86.67  73.33  70.0  60.0

In [160]:
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [161]:
type(df.T["향단"])

pandas.core.series.Series